eating_info = '''
    1. Слушайте свое тело. Учитесь распознавать сигналы голода и насыщения
2. Доверьтесь своим вкусовым предпочтениям. Ешьте то, что вам нравится
3. Не ограничивайте себя в пище.
4. Ешьте медленно и сосредоточенно. 
5. Не пытайтесь избавиться от эмоционального переедания. Иногда мы едим не из голода, а для того, чтобы справиться с эмоциональным стрессом или плохим настроением.
6. Принимайте свое тело таким, какое оно есть. Не стремитесь к размерам, которые не соответствуют вашей физиологии.
7. Будьте мягкими и добрыми к себе. Не настаивайте на строгих правилах питания и не осуждайте себя за то, что вы съели

Картинка поможет вам лучше отслеживать сигналы голода. Успехов!

'''

help = '''
Это телеграм-бот, который поможет наладить отношение с едой. 
/start - покажет вам эту справку 
/add_meal - добавляет прием пищи в дневник
/add_emotions - добавляет эмоции в днвеник
/del_meal - удаляет прием пищи из дневника 
/del_emotions - удаляет эмоции из дневника
/show_eat - показывает приемы пищи за день
/show_emotions - показывает эмоции за день
/INFO - короткая справка о принципах интуитивного питания
'''